backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [!!python/unicode 'input', 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 400, 400, 1]
      dtype: float32
      name: !!python/unicode 'input'
      sparse: false
    inbound_nodes: []
    name: !!python/unicode 'input'
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: !!python/unicode 'pad_1'
      padding: !!python/tuple
      - !!python/tuple [3, 3]
      - !!python/tuple [3, 3]
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'input'
        - 0
        - 0
        - {}
    name: !!python/unicode 'pad_1'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: !!python/unicode 'conv7x7_1'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'pad_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv7x7_1'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_1'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv7x7_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_1'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_1', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_1'
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: !!python/unicode 'pool_1'
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'pool_1'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id003 !!python/tuple [1, 1]
      name: !!python/unicode 'conv1x1_1'
      padding: !!python/unicode 'same'
      strides: &id004 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'pool_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_1'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_2'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_2'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_2', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_2'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_2'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id005 !!python/tuple [3, 3]
      name: !!python/unicode 'conv3x3g4_1'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_2'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_1'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_3'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_3'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_3', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_3'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_3'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple [1, 1]
      name: !!python/unicode 'conv1x1_3'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'pool_1'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_3'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: !!python/unicode 'conv1x1_2'
      padding: !!python/unicode 'same'
      strides: &id007 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_3'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_2'
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_5'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_3'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_5'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_4'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_2'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_4'
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_5'
        - 0
        - 0
        - &id002 {}
      - - !!python/unicode 'bn_4'
        - 0
        - 0
        - *id002
    name: add_1
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_4', trainable: true}
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_4'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_4'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_4'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_4'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_6'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_4'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_6'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_5', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_6'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_5'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_2'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_5'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_2'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_7'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_2'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_7'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_6', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_7'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_6'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_5'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_6'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_5'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_8'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_5'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_8'
  - class_name: Add
    config: {name: add_2, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'lrelu_4'
        - 0
        - 0
        - &id008 {}
      - - !!python/unicode 'bn_8'
        - 0
        - 0
        - *id008
    name: add_2
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_7', trainable: true}
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_7'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_6'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_7'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_6'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_9'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_6'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_9'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_8', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_9'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_8'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_3'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_8'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_3'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_10'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_3'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_10'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_9', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_10'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_9'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_7'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_9'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_7'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_11'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_7'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_11'
  - class_name: Add
    config: {name: add_3, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'lrelu_7'
        - 0
        - 0
        - &id009 {}
      - - !!python/unicode 'bn_11'
        - 0
        - 0
        - *id009
    name: add_3
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_10', trainable: true}
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_10'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_8'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_10'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_8'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_12'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_8'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_12'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_11', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_12'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_11'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_4'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_11'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_4'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_13'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_4'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_13'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_12', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_13'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_12'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: !!python/unicode 'conv1x1_10'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_10'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_10'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_9'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_12'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_9'
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_15'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_10'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_15'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_14'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_9'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_14'
  - class_name: Add
    config: {name: add_4, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_15'
        - 0
        - 0
        - &id011 {}
      - - !!python/unicode 'bn_14'
        - 0
        - 0
        - *id011
    name: add_4
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_13', trainable: true}
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_13'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_11'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_13'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_11'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_16'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_11'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_16'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_14', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_16'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_14'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_5'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_14'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_5'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_17'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_5'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_17'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_15', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_17'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_15'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_12'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_15'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_12'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_18'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_12'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_18'
  - class_name: Add
    config: {name: add_5, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'lrelu_13'
        - 0
        - 0
        - &id012 {}
      - - !!python/unicode 'bn_18'
        - 0
        - 0
        - *id012
    name: add_5
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_16', trainable: true}
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_16'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_13'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_16'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_13'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_19'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_13'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_19'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_17', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_19'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_17'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_6'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_17'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_6'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_20'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_6'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_20'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_18', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_20'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_18'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_14'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_18'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_14'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_21'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_14'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_21'
  - class_name: Add
    config: {name: add_6, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'lrelu_16'
        - 0
        - 0
        - &id013 {}
      - - !!python/unicode 'bn_21'
        - 0
        - 0
        - *id013
    name: add_6
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_19', trainable: true}
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_19'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_15'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_19'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_15'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_22'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_15'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_22'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_20', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_22'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_20'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_7'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_20'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_7'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_23'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_7'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_23'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_21', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_23'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_21'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: !!python/unicode 'conv1x1_16'
      padding: !!python/unicode 'same'
      strides: *id007
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_21'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_16'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_24'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_16'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_24'
  - class_name: Add
    config: {name: add_7, trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'lrelu_19'
        - 0
        - 0
        - &id014 {}
      - - !!python/unicode 'bn_24'
        - 0
        - 0
        - *id014
    name: add_7
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_22', trainable: true}
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_22'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id003
      name: !!python/unicode 'conv1x1_17'
      padding: !!python/unicode 'same'
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_22'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv1x1_17'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_25'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv1x1_17'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_25'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_23', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_25'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_23'
  - class_name: GroupedConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      cardinality: 4
      dilation_rate: !!python/tuple [1, 1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: !!python/unicode 'conv3x3g4_8'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_23'
        - 0
        - 0
        - {}
    name: !!python/unicode 'conv3x3g4_8'
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: !!python/unicode 'bn_26'
      scale: true
      trainable: true
    inbound_nodes:
    - - - !!python/unicode 'conv3x3g4_8'
        - 0
        - 0
        - {}
    name: !!python/unicode 'bn_26'
  - class_name: LeakyReLU
    config: {alpha: 0.30000001192092896, name: !!python/unicode 'lrelu_24', trainable: true}
    inbound_nodes:
    - - - !!python/unicode 'bn_26'
        - 0
        - 0
        - {}
    name: !!python/unicode 'lrelu_24'
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: !!python/unicode 'conv1x1_19'
      padding: !!python/unicode 'same'
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - !!python/unicode 'lrelu_22'
        - 0
        - 0
        - {}
